[{"id":1,"coverImage":"naruto_uzumaki_1.jpg","firstName":"Naruto","lastName":"Uzumaki","japaneseName":"うずまきナルト","alternateName":"Nine-Tails Jinchuuriki","gender":"Male","biography":"Ninja Registration Nº: 012607\nBirthday: 10 October \nAge: 12-13 (I) 15-16 (II)\nHoroscope: Libra\nHeight: 145.3cm - 147.5cm (I) 166cm (II)\nWeight: 40.1 kg-40.6 kg (I) 50.9kg (II)\nBlood Type: B\nFamily:[spoiler] Namikaze Minato (father), Uzumaki Kushina (mother)[\/spoiler] Jiraiya (godfather)\nAffiliation: Konohagakure no Sato, Mt. Myoboku\nRank: Genin\nPersonality: Doesn't like to lose\nLikes: Ichiraku's Ramen, Sakura, Oshiruko (VERY sweet azuki soup)\nDislikes: Fresh Vegetables, Akatsuki, Orochimaru, Ghosts, Cats\n\nBorn in Konohagakure, a ninja village hidden in the leaves, Naruto Uzumaki was destined for greatness. When born, a powerful nine-tailed demon fox attacked his village. With a wave of its tail, the demon fox could raise tsunamis and shatter mountains. In a valiant attempt to save the village from destruction, the Fourth Hokage and leader of the Hidden Leaf Village sealed the demon fox within Naruto's newborn body. This was his final act, for the battle with the fox cost him his life.\n\nDespite the Fourth Hokage's dying wish that Naruto be viewed as a hero for serving as the container for the demon (a [i]Jinchuuriki[\/i]) the adult villagers of Konoha harbored a fierce hatred for him, with many believing that Naruto and the demon were one and the same. Cast aside as an inhuman monster, Naruto was outcast and ostracised by the villagers for reasons he could not understand. The children his age could only ever follow their parents' example; and they too came to harbour a fierce hatred for Naruto.\n\nNaruto eventually came to accept that he would live and die alone, and his external response was to perform harmless pranks on the village. Coy, raffish and full of life, Naruto soon came to display a somewhat unexpected determination to succeed and be accepted by others. Upon being assigned to \"Team Seven\" as a Genin-ranked ninja, his true potential soon became outwardly apparent.\n\nVowing to become Hokage one day and using his will to never give in, Naruto saves the village from invading forces and earns his acceptance. Eventually, Naruto learns to harness the power of the Demon Fox sealed inside him to perform acts of strength far beyond what any other human is capable of.\n\nIn all, Naruto is an admirable character whose sheer determination to succeed despite the odds, earns him respect and devotion from his fellow villagers."},{"id":2,"coverImage":"mikasa_ackerman_2.jpg","firstName":"Mikasa","lastName":"Ackerman","japaneseName":"ミカサ・アッカーマン","alternateName":"","gender":"Female","biography":"Age: 15\nBirthday: February 10\nHeight: 170 cm (5'7\")\nWeight: 68 kg (150 lbs)\nPosition: 104th Trainees Squad, Scouting Legion\nGraduation Rank: 1st\n\nMikasa is Eren's adoptive sister and mutual childhood friend of Armin. Mikasa shares an unbreakable bond with Eren following events in their past, and rushes to protect him whenever he is in danger. Mikasa possesses impressive fighting skill and strength even as a child.\n\nAs an teen, Mikasa is considered a genius among all the army trainees and is incredibly skilled at combat and agility. She constantly worries for Eren's well-being and lives to protect him.\n\nWhen Mikasa was younger, her parents were murdered and she was taken hostage to be sold into slavery. Eren managed to find her and killed two of the three kidnappers by catching them off guard, despite only being a child. The third kidnapper discovered the scene and began strangling Eren while holding him in the air. Mikasa, trembling, grabbed Eren's knife from the floor. In that split second, Mikasa came to terms with the cruelty of the world, gaining perfect control of her own body and using that strength to kill the kidnapper in a single strike through the heart—killing him to save Eren.\n\nIn the aftermath of this trauma, Mikasa asked Dr. Jeager where she could possibly go from here. She was cold and had no place left to call home. Eren gave Mikasa his red scarf and Dr. Jeager welcomed her into their family. Because of Eren's heroics and this gesture, she feels she owes her life to the Jeagers. She continues to wear Eren's scarf from that day into adulthood, and they are inseparable."},{"id":3,"coverImage":"134331.jpg","firstName":"Yukiteru","lastName":"Amano ","japaneseName":"天野 雪輝","alternateName":"First","gender":"Male","biography":"Occupation: Middle School Student\nAlternate Name: First\nLikes: Having friends, writing in diary\nHeight: 161 cm\nWeight: 53 kg\n\nThe main male protagonist of the series and the First Diary user. Also known as Yuki (ユッキー, Yukkī), he is a 14 year old middle schooler who is a rather quiet boy with an anti-social behavior who doesn't talk much. He mostly sees things around him as a bystander and writes it down in his cell phone diary. Yuki becomes involved in the Diary Game when to his shock that Deus, a god-like being whom he thought was an imaginary friend turns out to be real, selects him as one of twelve contestants in a 90 day battle royale where they must kill each other using their special diaries where the last survivor becomes Deus' new heir. Yuki's diary is called the Random Diary, which written from his point of view, gives a detailed explanation of his surroundings very accurately whether it be the present or the future. While versatile in any situation, the main disadvantage of the Random Diary is that it doesn't tells him what is happening to himself which leaves him vulnerable. Furthermore, since the diary is written from his point of view, Yuki can be tricked into thinking something he sees is true without realizing it which is a disadvantage for other people who use the Random Diary.\n\nUnlike most of the contestants, Yuki doesn't want any part of the game as he just wants to live peacefully and doesn't want to kill anyone, but is forced to play to survive and will only kill as a last resort as he is the main target by the other diary users because Deus sees Yuki as his favorite to win. Because he is weak, in order to protect himself, he quickly makes friends and allies to help him including Yuno Gasai, a girl in his class who is madly in love with him and is another diary user. Yuki is kind person yet is naive for quickly trusting people whether they be friend or other diary users as they may have ulterior motives. The most complex relationship he has is Yuno, while Yuno is a formidable ally, her mad obsessive love for him to the point she is willing to kill or use anyone so both of them can survive scares him yet despite the many things she does that shocks him including kidnapping him against his will and learning she killed her parents, Yuki still relies on Yuno in order to protect himself.\n "},{"id":4,"coverImage":"155093.jpg","firstName":"Yuno","lastName":"Gasai ","japaneseName":"我妻 由乃","alternateName":"Second","gender":"Female","biography":"Birthday:16 november (Scorpio)\nOccupation: Middle School Student\n Likes: Yukiteru\nHeight: 159 cm\nWeight: 49 kg\n\nYuno Gasai is obsessively in love with Yukiteru (Yandere) as one can safely guess from just the simple name of her future diary. Yukiteru's condition and actions are recorded every ten minutes in her \"Yukiteru\" diary, it also provides small commentary made by Yuno in some of the entries. Its most obvious weakness is that it does not show Yuno's future at all—her condition, situation, or surroundings—unless it somehow involves Yuki. Working with Yukiteru's \"Random Diary\" diary, however, covers both of their diaries' individual flaws; as it has been said the two make for a perfect combo.\n\nSmart, beautiful and diligent—those who don't truly know Gasai Yuno would simply see the model student role she plays while at school. She is secretly obsessed with Yukiteru and would do anything within her power to assist him. She can be quite clingy and is highly fond of stalking him. When obstacles arise that either endangers Yukki's life or threatens their relationship, her thoughts turn murderous and she lets nothing get in the way of her path. Yuno is also able to quickly analyze and adapt to unexpected situations that may arise, and she puts thoughts into action without hesitation, performing what needs to be done without ever losing her nerves. These traits make her one of the strongest players in Deus's game, despite having one of the weakest diaries for providing self survival aid. And while Yukiteru is credited for triggering the greatest shift in future occurrences, Yuno is the one who has created the largest influence in those events. Yuno tends to carry around a box cutter with her at all times, though she will make use of other weaponry such as kitchen knives, hatchets, etc, when required.\n\nShe is named after the Roman goddess Juno.\n "},{"id":5,"coverImage":"141865.jpg","firstName":"Deus Ex","lastName":"Machina","japaneseName":null,"alternateName":null,"gender":"","biography":"The god of time and space, Yukiteru's supposed imaginary friend and the mastermind behind the game. He is looking for a successor, which is why he gave future diaries to twelve candidates and placed them in a game of life and death. He seems to favor Yukiteru the most out of all the other candidates as his next possible successor due to the miracles Yukiteru is able to pull off, not paying attention to the fact that Yuno is helping him.\n\nDeus Ex Machina means the God born of the Machinime in Latin.\n\n "},{"id":6,"coverImage":"141863.jpg","firstName":"Mur","lastName":"Mur","japaneseName":null,"alternateName":null,"gender":"Female","biography":"Age: Unknown, Immortal\nOccupation: Deus's Servant\nLikes: Food, fooling around, Shoujo Manga\nHeight: 95 cm\nWeight: 22 kg\n\nDeus' servant, Mur Mur is often seen with the eliminated candidates in omake panels. As of chapter twenty-four it is revealed her favorite is Yuno Gasai, and she is betting on her to win the game. She has a rather playful and nonchalant attitude toward Deus despite his warnings to her. \n\nIn a spin-off series she accidentally destroyed Yuno from existence, so she currently has taken Yuno's place as the Second till the damage can be fixed. \n "},{"id":7,"coverImage":"141993.jpg","firstName":"Ouji","lastName":"Kousaka","japaneseName":"高坂 王子","alternateName":null,"gender":"Male","biography":"Another one of Yukiteru's classmate, Ouji is in Yukki and Yuno's classroom during the previous semester and is one of the first people to betray him during the terrorist bombing incident. He writes down a list of all of his proudest accomplishments in a blog he dubs the \"Kousaka King Diary\", often using the phrase \"I'm Shining!\" after each sentence. \n "},{"id":8,"coverImage":"160081.jpg","firstName":"Minene","lastName":"Uryuu","japaneseName":"雨流 みねね","alternateName":null,"gender":"Female","biography":"Age: 18\nOccupation: International Wanted Terrorist\nLikes: Unknown\nHeight: 168 cm\nWeight: 55 kg\n\nMinene Uryuu is a terrorist bomber. Like the Fourth, her \"Escape\" diary goes along with the type of profession she is involved in. Whenever Minene faces a dire situation, the diary will chart out the best course of actions she can take in order to get out of a tight spot. Based on the function of her diary, it might even help reduce the chances of her receiving a Dead End and it is probably one of the best diaries to have in Deus' game of survival. The diary's only shortcoming is that there are some circumstances where the odds are too heavily stacked against Minene to the point where the diary won't be able to secure an escape route for her. \n\nAn infamous atheistic terrorist, Minene is a young woman who bears a strong hatred for organized religion, particularly God. \n\nSpoiler:\nHer hatred of religion stems from her past when she and parents were traveling in a city in the Middle East but got caught in a battle, which is hinted between Israelis and Palestinians, where her parents were killed in the crossfire. Blaming God for her parents' death, she leads a crusade of destruction against those associated with God. \n\nMinene got involved in the Diary game after a failed assassination to kill a Catholic Cardinal. She tried to escape but almost fell to her death and was saved by Deus, who gave her an offer to save her if she joined his game. Minene's diary is the Escape Diary, which will chart out the best course of actions for her to escape whenever she finds herself in a dangerous situation. While it means she can escape anything, it is not perfect as the diary can only tell her how to escape if there are favorably conditions that allow her any chance to escape. \n\nOriginally, she wants to win the game to destroy religion worldwide but later mellows out after befriending Yuki and his friends. While she began as an antagonist against Yuki, she later became his ally, becoming a big sister figure to him and both of them hold no animosity with each other despite Minene was responsible for the destruction and deaths at his school and Yuki was the one who blinded her left eye. She shares an interesting relationship with Masumi Nishijima of the police whom she met during her failed assassination of the Cardinal. While she constantly dismisses all of his attempts to get to know her, she finally relents and eventually falls in love with Masumi. \n\nIn the anime, during the last episode it was shown that Minene, from the second world, and Masumi, from the third world live together and have two children. Third world Minene is still a terrorist.\n \n "},{"id":9,"coverImage":"150011.jpg","firstName":"Rias","lastName":"Gremory","japaneseName":"リアス・グレモリー","alternateName":"Crimson Ruin Princess","gender":"Female","biography":"B\/W\/H: 99\/58\/90\nHeight: 172 cm (5'8\")\nRank: Top-class Devil\nRole: King\nRace: Pure blooded Devil\nPower: Power of destruction\nFirst Appearance: Volume 1\n\nA 12th grade student and the prettiest girl in the academy. Comes from the old noble of pure devils, the house of Gremory, a top-class devil who is called a genius nicknamed \"Crimson Ruin Princess\". Her brother is in fact one of the Yondai-Maou, Lucifer. Both of them possess the power of destruction. She revives Issei as her servant after finding him dead, killed by a fallen-angel and possessing a rare Sacred Gear.\n\nFrom her mother, Rias has inherited the Bael Clan's Power of Destruction. This power allows her to release energies that can disintegrate matter, both living and inanimate, with relative ease. Opponents who wield sufficiently greater power, however, can shield themselves from this.\n\nRias has gained the ability to project a red light from her breasts, which recharges Issei's energy. Each use of this power causes her breasts to temporarily shrink in size, which makes Issei cry even though it's sometimes necessary. Her breast size will restore itself after a few days of rest."},{"id":10,"coverImage":"211641.jpg","firstName":"Issei","lastName":"Hyoudou","japaneseName":"兵藤一誠","alternateName":"Pawn","gender":"Male","biography":"Age: 17\nHeight: 170 cm (5' 7\")\nWeight: 62 kg (137 lbs.)\nRank: Middle-class Devil\nRole: Pawn (8 Pieces)\nRace: Reincarnated Devil (Former human)\nSacred Gear: Boosted Gear (Longinus)\nWeapon: Ascalon\nPower: Dress-Break, Bilingual, Dragon flames\n\nA second-year high school student attending Kuou Academy. He is known to be stupid, lecherous and a pervert among his peers. A normal high school student born in a normal family, but is in possession of the Sacred Gear \"Boosted Gear\" which is listed as one of the ultimate Sacred Gears (Longinus). He was killed by his first girlfriend, a Fallen Angel, and was revived as a Devil and a servant of Rias Gremory, his new master. Now he aims to become a Harem King by gaining a peerage, unaware of himself attracting girls around him."},{"id":11,"coverImage":"30971.jpg","firstName":"Misa","lastName":"Amane","japaneseName":"弥海砂","alternateName":"Misa-Misa, 2nd Kira","gender":"Female","biography":"Birthdate: December 25, 1984 (1987 in the anime) \nBorn in: Kyoto\nHeight: 152 cm (4 ft 11 in)\nWeight: 36 kilograms (79 pounds)\nB-W-H: 76 cm - 51 cm - 75 cm\nBlood Type: AB\n\nMisa is a famous model, singer and actress and has an immense crush on Light Yagami. She usually refers to herself in the third person by calling herself \"Misa-Misa\" and tends to be hyperactive. She poses as the second Kira to attract the attention of the first Kira.\n \nShe decides to devote her life to Light because he punished the criminal that killed her parents when she was younger; a burglar killed Misa's parents in front of her eyes. Misa, unable to forgive the killer and wanting to kill the burglar herself, saw multiple delays in the killer's trial before Kira killed him. The Shinigami who follows her is Rem. Misa also performs two eye trades, cutting her lifespan in half twice; the first was with Rem, and the second with Ryuk.\n "},{"id":12,"coverImage":"31498.jpg","firstName":"Mihael","lastName":"Keehl","japaneseName":"ミハエル・ケール","alternateName":"Mello","gender":"Male","biography":"Age: 13-15 pre-timeskip, 19-20 post-timeskip\nSpecies: Human\nDate of birth: 13 December 1989\nOccupation: Mello is a former resident of the Wammy House who later joined the mafia to catch Kira. \nBlood type: A\nLikes: Chocolate\n\nMello is the older of L's two successors raised in Wammy's House, Watari's orphanage for gifted children, in Winchester, England, United Kingdom. When it is decided that Mello should work with the other successor, Near, Mello refuses, citing an inability to work with Near, to whom he is considered second. Similar to L's fondness for sweets, Mello is often seen eating bars of chocolate. How to Read 13 states that Mello has \"an excellent mind\" and that he \"sometimes lets his emotions get in his way.\" The book cites Mello's \"hatred of Near,\" which created \"a flaw in [Mello's] personality.\" The book states that Mello isn't purely evil, citing his apology and genuine care for Matt's well-being. Tsugumi Ohba, the writer of Death Note, stated that Mello \"works hard for everything.\" Ohba added that Mello's name \"doesn't really stand for anything,\" as opposed to Near's name standing for Nate River, etc.\n\nMello is voiced by Nozomu Sasaki in the Japanese anime, David Hurtwitz in the English version and Javier Olguín in the Latin Spanish dub.\n \nMello decides to find Kira his own way by joining the Mafia. After obtaining one of the Death Notes from the Kira investigation team by kidnapping Sayu Yagami, Light Yagami sets up a raid that leaves Mello badly scarred and his real name in Light's hands. After learning that Light is Kira and Near was going to attempt to apprehend him, Mello kidnaps Kiyomi Takada, but is soon killed by Takada's hidden pages of the Death Note. This action causes Teru Mikami to expose his own Death Note to kill Takada, an action that Near picks up on and is eventually able to use to thwart Light's plans. Near reflects this during the final showdown and credits Mello as the single most pivotal person in discovering Light's plans. Hal Lidner further believes that it was Mello's plan that he would be killed to expose Light's plan, but Near rejects this theory.\nHis date of death is January 26th, 2010. Age 20.\n\n\nMello is the narrator of the spinoff novel Death Note - Another Note: The Los Angeles BB Murder Cases.\n "},{"id":13,"coverImage":"73321.jpg","firstName":"L","lastName":"Lawliet","japaneseName":"エル・ローライト","alternateName":"Ryuga Hideki, Ryuzaki, Eraldo Coil, Deneuve","gender":"Male","biography":"Birthday: October 31, 1979 \nZodiac sign: Scorpio\nHeight: 5'8\"\nWeight: 110 lbs.\nBlood type: unknown\nLikes: Sweets\nDislikes: Wearing Socks\n \nDate of Death: November 5, 2004 (2007 in anime)\n\n(Source: Death Note vol. 13 Profiles)\n\nL, who also uses the aliases Hideki Ryuga, Ryuzaki, Eraldo Coil and Deneuve, the latter two for which he has developed reputations as the second—and third—best detectives in the world, is quite secretive and only communicates with the world through his assistant Watari. He never shows his face to the world, instead representing himself with a capital L in Cloister Black font. After meeting the Kira investigation team, he requests that the task force refer to him as Ryuzaki for discretion. The Kira investigation team never learns his true name. Ohba said that L is the smartest character in the manga because \"the plot requires it.\" Ohba also said that he personally views L as \"slightly evil\"; for instance, in chapter 109, Near discloses the fact that L claimed to pursue cases out of personal interest with no great sense of justice.\n\nWhen asked about L's nationality, Ohba responded saying \"I think of him as a quarter Japanese, a quarter English, a quarter Russian and... maybe a quarter French or Italian? Something like that.\"\n\nTom S. Peperium of IGN described L's voice in the English anime version as \"low monotone, while inspired by the original Japanese actor, sounds like a man deep in thought, a master detective on the hunt.\"\n\nOhba said that his favorite human character in the series was L as Ohba believed that L was the \"strongest\" character in the series \"besides Light.\" Obata chose L as his favorite due to \"appearance, personality, everything.\" Obata said that he could never have created L and that he enjoyed drawing L. Obata added that because of this, L is not \"real\" to him and therefore he likes that aspect of L. In response to the question \"Who was the most fun to draw?\" both Ohba and Obata answered \"L.\"\n\nL's disheveled and languid appearance masks his great powers of deduction and insight. He tends to second-guess everything he is presented with, and is extremely meticulous and analytical. He has several quirks such as preferring to crouch rather than sit, eating only sweet foods like desserts and fruits, and holding items very delicately. L stayed in England for five years, and during that time he was the champion in tennis for the England Junior Cup. L also secretly assumes the identities of the world's second and third best detectives, (Eraldo Coil and Deneuve respectively).\n\nIn chapter 38 of the manga, L suggests that even though he eats only sweet foods, he remains underweight because the brain uses the most calories of any organ in the body. He also says that if he sits normally, his reasoning ability would drop 40%.\n\nWhenever L gives percentages to indicate how much he suspects a person of committing a crime, such as \"five percent,\" in reality he means over 90 percent. Although L gives Light a low percentage indicating how much he suspects Light, in reality L is \"pretty certain\" that Light is Kira. Ohba said about L, \"The truth is, he's a liar.\"\n "},{"id":14,"coverImage":"31500.jpg","firstName":"Nate","lastName":"River","japaneseName":"ネイト・リバー ","alternateName":"Near, N","gender":"Male","biography":"Age: First appearance: 13 years old, Final chapter : 19 years old, Final appearance : 21 years old\nSpecies: Human\nDate of birth: 24 August 1991 (1994 in anime)\nOccupation: Head of SPK (Secret Provision for Kira), 3rd and final \"L\" in chapters 108 and aftermath\nBlood type: B\nLikes: toys and puzzles\nDislikes: Kira\n\nIn Death Note, Near is the younger of L's two successors raised in Wammy's House, Watari's orphanage for gifted children, in Winchester, England, United Kingdom. Of the successors, Near is the more level-headed, calmly assessing the situation, while the other, Mello, is more emotional and quick to act. Much like L, Near shows various odd behaviors during his normal life. He is usually seen hunched over rather than sitting. He also constantly plays with various toys, which he uses in his theories, as well as idly twiddling strands of his hair. He shows a great respect for L, basing much of how he solves crime on L's methods, even to the point where he only takes cases that he is interested with rather than trying to pursue justice. Near uses the Wedding Text font \"N\" and \"L\" to represent himself and the fake L, respectively. But later in the aftermath, he used Old English font \"L\" like the original L did. He is voiced by Noriko Hidaka in the Japanese anime, Cathy Weseluck in the English dub, and Bruno Coronel in the Latin Spanish version.\n \nIt is speculated by Matsuda in Death Note: Oneshot that Near uses the Death Note to manipulate Mikami into failing Light in the final battle, which would shed light on some major plotholes. It's important to note that Tsugumi Ohba has said that he wanted it to be left up to the readers on if Matsuda is right or not.\n\n\nTsugumi Ohba, writer of Death Note, said that Near \"becomes less likeable\" as the story advances, citing Near's plan to take the notebook at a later point in the story. Ohba said that a negative reaction originated from \"the difference in their attitudes\" and that people may have viewed Near as \"a cheat.\" Ohba added that Near's \"cheeky behavior,\" intended to \"reinforce his childishness,\" had been construed as \"annoying.\"\n\nIn the final chapter Near brings finger puppets to the Yellow Box Warehouse. Takeshi Obata, artist of Death Note, said that Near first bought the Kira finger puppet and drew on it with a magic marker. Obata then said that Near must have created the other puppets afterwards. Obata views Near as not liking L much so Obata had Near depict L as \"ugly\", and that Near \"worked hard\" on Mello's puppet as Near \"liked Mello.\"\n\nObata said he enjoyed drawing Near and that Near is also one of his favorite and his least favorite characters, considering him to be the smartest character in the manga \"because he cheats.\"\n\nWhen asked about which character was most similar to himself, Ohba indicated Near and \"maybe Light.\" Regarding Near, Ohba said that he does not leave his house often.\n "},{"id":15,"coverImage":"63870.jpg","firstName":"Light","lastName":"Yagami","japaneseName":"夜神 月","alternateName":"Kira","gender":"Male","biography":"Name: Light Yagami\nBirthdate: February 28, 1986 (1989 in the anime)\nZodiac sign: Pisces\nHair Color: Brown\nEye Color: Brown\nHeight: 179 cm (5'10\")\nWeight: 64.1 kg (141 lbs.)\nBlood Type: A\nOccupation: High School Student, University Student, Detective\nAge (during the series): 17-23\nLikes: Justice\nDislikes: Evil\n\nLight, born on February 28, 1986, is a third year high school student (12th Grade) at Daikoku Private Academy (大国学園, Daikoku Gakuen) who also attends supplemental classes at Gamou Prep Academy in the beginning of the story. Light has a father, Soichiro Yagami, who is the head of the Police Force. Light also has a mother, Sachiko Yagami, and a younger sister, Sayu Yagami.\n\nIn Spring 2004, Light becomes a first-year student (freshman) at To-Oh University (東応大学, Tōō Daigaku), becoming one of two freshman representatives; L is the other freshman representative. During a tennis game with L at To-Oh, spectators reveal that Light was the junior high school tennis champion in 1999 and 2000. After his 2000 victory, Light quit tennis as he entered high school.\n\nYagami Light is a brilliant college student. Nicknamed \"Kira,\" he uses the Death Note to create his ideal world of justice under him; its new God. Though he looks frail, Light is an extremely athletic person, with an aptitude to find an opponent's weak point. He is a genius, which adds to his notion that only he is fit to judge humanity and steer it on a proper moral course.\n\n [spoiler]\nHe gets shot by Matsuda after his plan failed and then dies because Ryuk wrote his name in his Death Note.\n\n(January 28th 2010 in Manga, January 28th 2013 in Anime)\n[\/spoiler]"},{"id":16,"coverImage":"33815.jpg","firstName":"C.C.","lastName":"","japaneseName":"シー･ツー","alternateName":"Gray Witch, Pizza Girl, C2","gender":"Female","biography":"Height: 167 cm\nHair color: lime\nEyes color: yellow\nAllegiance: The Black Knights\nKnightmare Frames: Burai, Gawain (co-pilot), Lancelot Frontier, Pink Akatsuki Command Model Zikisan\n\nC.C. is apparently immortal, healing from any wound (implied to include beheading) with enough time. She also doesn't age. Apart from her immortality, C.C. has the ability to bestow people with the power of Geass, which manifests differently in each person but generally carries the ability to affect the minds of those it is used on in some way. The Geass sigil glows on her forehead whenever she manifests this power, and she has a similar scar on her left breast. It is hinted that many more like her exist, as shown in her memories of many children with similar sigils, and she suggests that the power has precipitated bloody conflicts in the past. Her powers caught the interest of Britannia, who imprisoned her for experimentation purposes.\n\n[spoiler]\nBefore she gained the power of Geass, C.C. was a ten-year old escaped slave. A church nun gave C.C. the power of Geass, making everyone around her fall in love with her. Once C.C.'s power evolved to its highest point and she grew tired of all the proposals and gifts, the nun transferred her immortality to C.C., allowing her to die while leaving C.C. in the position of repeating the cycle.\n\nIn the first season finale, C.C. triggers a trap set by V.V., causing herself and Lelouch to be submerged in a shock image sequence similar to the one she used on Suzaku. Through this, Lelouch sees memories of her past, including repeated \"deaths\". One shows C.C. attempting to escape from a battlefield, only to be shot in the forehead. Further memories show her being persecuted as a witch and suffering various forms of torture and\/or execution throughout history and various time periods, including burning at the stake, guillotining, and the iron maiden. This would suggest a minimum lifespan of at least six centuries. In a special feature included in the series' fifth DVD, she and Lelouch discuss Washington's Rebellion, during which she speaks of participants such as George Washington and Benjamin Franklin as if she had been close friends with both. In the past, she appears to have observed Suzaku and Lelouch when they were both children, having even interacted with Lelouch at one point, though he doesn't remember their meeting.\n[\/spoiler]\n\nHer individual experiences have led C.C. to become a detached and lonely individual, with little care for even those she has entered into contracts with, while in the past she was somewhat a spoiled and cheerful girl. She tells Lelouch that she has been alive so long that she can no longer remember who loves her and who hates her. Due to her nature and history, she has been lonely as long as she can remember. Lelouch replies, \"You're not alone. We are partners. If you are a witch, then I shall become a demon.\" Lelouch is possibly the first person that has ever truly cared for her and it appears that she reciprocates at least some of these feelings, as she unexpectedly kisses him after their memories are shared.\n\nC.C. has a strong penchant for pizza, especially Pizza Hut's (which sponsors the show in Japan, though the logo is blurred out in the English dub); she constantly orders pizzas to Lelouch's house using his credit card. She also carries around a stuffed toy of \"Cheese-kun\", the company's mascot in Japan. Her love of pizza is often used for comedic effect, as she was twice willing to risk capture simply to get a piece of a giant pizza being made by the Student Council (which is ruined both times); she doesn't trust Lelouch to retrieve it for her. Both Lelouch and Kallen sometimes refer to her as \"Pizza Girl.\"\n \n[spoiler]\nWhen left alone, she has sometimes spoken to a previously unknown person through means unknown, which, in episode 23, was revealed to be Marianne, Lelouch's deceased mother, although in episode 19 it appears that she is talking to V.V. as well. According to the DVD Magazine 02, she is talking to more than one person when she seems to be talking to herself. In the past, it was shown that she and Marianne were close.\n[\/spoiler]\n "},{"id":17,"coverImage":"31564.jpg","firstName":"Suzaku","lastName":"Kururugi","japaneseName":"枢木スザク","alternateName":"White Knight, Knight of Seven, Spinzaku, Knight of Zero Read ","gender":"Male","biography":"Age: 17 (first season), 18 (second season)\nDate of Birth: July 10, 2000 a.t.b.\nZodiac Sign: Cancer\nBlood Type: O\nHeight: 176cm (5'9\")\nNationality: Japanese\nKnown Relatives: Genbu Kururugi (father, deceased), Kaguya Sumeragi (cousin)\nKnightmare Frame: Lancelot and Lancelot Albion\n \nLelouch's childhood friend and son of Japan's last prime minister. After Britannia's takeover of Japan, Suzaku joins the Britannia Army and becomes an Honorary Britannian. He agrees with Zero (Lelouch in disguise, unknown to Suzaku) with his assertion that the Britannia Empire is not worth serving, but nevertheless wishes to implement changes and improvements from within the empire, all the while trying not to lose sight of his goals lest his father's death have been in vain. He has a strong sense of justice and is the only one known to be able to pilot the elite Britannian Knightmare Frame, Lancelot. He always keeps with him a broken pocket watch, a memento of his deceased father. \n \n[spoiler]\nHe is in love with Euphemia and is devastated upon her death. He swears revenge against Zero, for killing her.\n\nIn the last episode of R2, Lelouch asks Suzaku to kill him (as all of the world's hatred is now focused upon him) and to become Zero. Suzaku kills Lelouch in front of all the Black Knights and Nunnally at a parade held for Lelouch. After Lelouch dies, Suzaku takes care of Nunnally as Zero and leads the Black Knights.\n[\/spoiler]"},{"id":18,"coverImage":"30505.jpg","firstName":"Lelouch","lastName":"Lamperouge","japaneseName":"ルルーシュ・ランペルージ","alternateName":"Lulu, Lelouch vi Britannia, Black Prince, Zero, King of Elevens ","gender":"Male","biography":"Age: 17 (first season), 18 (second season)\nDate of Birth: December 5, 2000 a.t.b. (Sagittarius)\nBlood Type: A\nNationality: Britannian\nHair Color: Light Black\nEye Color: Purple\nHeight: 178 - 183 cm\nWeight: 54 kg\nOccupation: Ashford Academy Student\nKnown Relatives: Charles zi Britannia (father), Marianne vi Britannia (mother, deceased), Nunnally vi Britannia (little sister)\nAlter-Ego: Zero\nAllegiance: Order of the Black Knights\nPosition: Order of the Black Knights Leader\nKnightmare Frame: Burai, Gawain, Shinkiro\nFavourite quote: The only ones who should kill, are those who are prepared to be killed.\n\nLelouch is introduced in the first episode of the series as a student of Ashford Academy high school, where he is a member of its student council. A brilliant thinker who is quite talented at chess, he lives with his younger sister, Nunnally, with their maid, Sayoko Shinozaki, at a house situated within the compounds of Ashford Academy, where they are looked after by the Ashford family.\n\nLelouch is soon swept into the conflict between the Britannia Empire and the pockets of resistance which oppose it when he accidentally boards a truck being used by Japanese resistance operatives. Within the truck is a capsule holding C.C., who sacrifices herself to save him from the military forces trying to recapture her. When it seems as if her sacrifice was pointless, C.C. suddenly touches his hand and offers him the \"Power of the King,\" the mythical power of Geass. The Geass manifests itself in him as the power of absolute obedience, which allows him to make people obey his orders without question. \n\nWith his new power, Lelouch begins his rebellion against the Empire, forming the Order of the Black Knights and takes up the identity of Zero to lead them, becoming a revolutionary and gaining popular support amongst the people.\n \n[spoiler]\nLelouch is the son of the Emperor of Britannia, Charles zi Britannia, and the late Imperial Consort Marianne, making Lelouch the eleventh prince of the Britannian Imperial Family. He was seventeenth in line for the throne prior to his mother's assassination and his sister's crippling in the same incident. A ten year old Lelouch confronted the Emperor afterward and accused him of leaving his mother defenseless, even going as far as renouncing his entitlement to the throne. In response, his father banished him to Japan, where he was used as a political hostage in the Sakuradite conflict.\n\nIt was during his stay at the Kururugi household that he first met Suzaku Kururugi, with whom the young Lelouch did not interact initially in a friendly manner, before later becoming friends. However, when Britannia finally developed its Knightmare Frames fleet and decided to invade Japan to seize control of the Sakuradite mines, consequently discarding Lelouch's use as a diplomatic tool, Lelouch, fearing for his and his sister's safety, hid their true identities and sought the help of the Ashford family, who were his mother's allies.\n\nHis mother's death and his father's apparent lack of concern in regards to it were huge blows to Lelouch. He always felt that it was unfair for both his mother and sister, and therefore made it his goal to pursue a better world for Nunnally. He also seeks to discover the true reason for his mother's death, as she was murdered in the Aries Imperial Palace, a place terrorists would be unlikely to penetrate successfully without being noticed, if at all.\n\nShortly after gaining the power of Geass from C.C., Lelouch assumes the secret identity Zero, a mysterious, masked revolutionary dressed in a black helmet and cloak. The helmet has a retractable plate over the left eye so Lelouch can use his Geass. In this guise, he forms the Order of the Black Knights, initially composed of the members of Kallen Kōzuki's resistance group. The goal of this vigilante group is a campaign against powerful individuals who oppress the helpless, which he eventually expands into reforming Japan as an independent nation.\n\nLelouch is willing to do whatever it takes to accomplish his goal, even if it means lying to his followers and using people as bait for the outcome he desires. However, he has trouble putting those he is close to in harms way for the sake of his goal, which is a weakness as a commander but a remnant of his humanity and sanity. His feelings for Nunnally in particular often hinders his plans, particularly at the end of the first season, where he abandons a massive war with Britannian forces to rescue her. Gradually, however, he has come to embrace the fact that he has to destroy before reconstruction can occur, even if it means harming those he cares about.\n\nOriginally, Lelouch is motivated by the desire to avenge his mother's death and construct an ideal world where his sister Nunnally can live in peace. After Nunnally becomes Viceroy of Area 11, and her wishes conflict with his goals, his friends help him to realize that his rebellion is no longer just for Nunnally, but for all the people of the world. Following Nunnally's death and the betrayal of the Black Knights, Lelouch focuses on making sure that he at least takes the Emperor down with him.\n\nThe turning point in his rebellion comes when Euphemia li Britannia declares the region under Mount Fuji the Special Administrative Zone of Japan, giving the Japanese people their name and country back, albeit in a much smaller area. This effectively destroys any possibility of the Black Knights' rebellion; acceptance would render them powerless and refusal would make them pariahs. Lelouch confronts her at the opening ceremony and tries to have her shoot him, hoping to make himself a martyr. When she says she plans to give up her title, he surrenders and agrees to work with her. However, at this moment his Geass permanently activates, and an offhand comment about ordering her to kill the Japanese forces her to do just that. Lelouch reluctantly kills her and uses the massacre as an excuse to declare Japan an independent nation. He then leads an attack on the Tokyo Settlement. The attack goes well at first, but when Lelouch learns that Nunnally has been kidnapped, he abandons the battle, leaving his forces helpless against the much better organized Britannian forces.\n\nLelouch and C.C. make their way to Kaminejima to search for Nunnally, where Lelouch is confronted by Suzaku Kururugi. Lelouch attempts to broker a truce, but Suzaku is distraught over the death of Euphemia and refuses to listen. An angered Lelouch draws his pistol and both Lelouch and Suzaku attempt to shoot one another. A single gunshot is heard as the screen fades to black at the end of the first season.\n[\/spoiler]\n\nSeason Two\n[spoiler]\nOne year later, Lelouch is living a peaceful life with his younger brother, Rolo Lamperouge, and has no memory of his revolutionary activities, his Geass, Nunnally, his mother, or his royal lineage. Flashbacks reveal that neither Suzaku or Lelouch managed to kill one another. Instead, Lelouch was apprehended and brought before the Emperor, who used his own Geass to wipe Lelouch's memories and suppress his power.\n\nLelouch's memories and Geass are restored by C.C., and he resumes leadership of the Black Knights. To prevent retaliation by the Britannian forces, he makes his base in the Chinese Federation's consulate. When Nunnally is appointed as Viceroy of Area 11, and announces her plans to reestablish the Special Administrative Zone of Japan, Lelouch falls into depression since he would be impeding her wishes by continuing his rebellion. He nearly begins taking Refrain before Kallen stops him. With the help of Kallen and his friends at the Ashford Academy, Lelouch realizes that his mission no longer revolves solely around Nunnally, but concerns the rest of his friends, and the Japanese people as well. To solve both concerns, Lelouch engineers the legal exile of the Black Knights by getting the Britannians to agree to exile Zero in exchange for bringing one million participants for Nunnally's new Japan. By having them all dress as Zero, he forces Suzaku to exile them all rather than order a massacre. Sayoko stays behind as his body double to keep up the illusion that Lelouch and Zero are separate people, though during her short tenure as his impersonator she changes his image into that of an athletic womanizer.\n\nThe Black Knights escape to the Chinese Federation, where Lelouch begins his plans to win more countries to his side, creating a alliance that can match the Britannian Empire. He starts by overthrowing the High Eunuchs of the Chinese Federation and returning control to Empress Tianzi. He also has a secondary motive in doing so: the Chinese Federation is where V.V.'s Geass Directorate is headquartered. By taking control of the directorate, Lelouch believes he will be able to match the Emperor in both military and Geass might. While the remaining dissident forces are cleaned up, Lelouch returns to Japan to prepare for the invasion by installing Gefjun Disturbers in the mass transit rail system. The combined effect of every train running a Disturber would shut down Tokyo Settlement completely.\n\nAfter Shirley is killed by Rolo, Lelouch abandons his plan to take over the Geass Directorate, instead mounting an all-out assault on their stronghold. He orders the deaths of everyone within, resulting in the death of General Bartley among countless others. V.V. tries to use the Siegfried to buy time for the remaining members to escape, but it is destroyed with the aid of Cornelia while C.C. annihilates the remaining followers. Lelouch chases V.V. back into the temple, where he is unexpectedly teleported to the Sword of Akasha to face the Emperor. Lelouch attempts to kill the Emperor, but he has become immortal like C.C. The Emperor tells Lelouch about the world's lies, and shortly after C.C. arrives, finally revealing the contents of their pact. She would have had Lelouch kill her and take on her immortality, but instead spares him by placing him inside her memories while the Emperor kills her. Lelouch refuses to let her die unhappy and convinces her to live on. Lelouch destroys part of the Sword of Akasha and is transported back to the real world with C.C., but her memories of her life after gaining Geass have been erased.\n\nLelouch then completes ratifying the United Federation of Nations, and their first act is to liberate Japan. To insure Nunnally's safety, Lelouch agrees to meet Suzaku alone at the Kururugi Shrine. Suzaku demands answers about Lelouch's various uses of Geass, but Lelouch lies, claiming that everything he has ever done was purely for selfish reasons. Suzaku realizes that Lelouch is lying and agrees to help, but Prince Schneizel's troops move in to arrest Lelouch, convincing him that Suzaku sold him out. Lelouch escapes with the help of Guilford, having used his Geass to make Guilford see him as Princess Cornelia, and uses the Gefjun Disturber trains to shut down Tokyo Settlement. He resolves to abandon his emotions in order to achieve his goals, having lost his faith in friendship.\n\nIn the second battle of Tokyo, Lelouch directs his forces to focus on the government building in an effort to secure Nunnally. Suzaku threatens to use the F.L.E.I.J.A. bomb unless Lelouch stands down, but Lelouch merely waves him off as a liar. Once Kallen escapes in her upgraded Guren and Suzaku becomes an obstacle, Lelouch orders her to kill him. As her Knightmare is far more advanced, she nearly succeeds. Suzaku's imminent defeat activates his Geass command, causing him to launch F.L.E.I.J.A. The bomb engulfs the government complex, killing Nunnally among countless others. Lelouch goes into a nervous breakdown at the thought, refusing to believe that Nunnally could be dead. His identity is then exposed by Schneizel and the Black Knights betray him. Rolo evacuates him, but dies in the attempt. In the end, Lelouch comes to terms with his feelings for Rolo. Having lost everything as retribution for his acts, he realizes that the last thing he must do is drag his father into hell with him.\n\nWith his renewed purpose, Lelouch quickly sets off to defeat the Emperor, throwing the Britannian ranks into chaos by using his Geass to make numerous soldiers slaves to his will. As the Britannian forces battle one another, Lelouch confronts the Emperor in the Sword of Akasha, sealing the entrance behind him so they will both be trapped for eternity.\n[\/spoiler]\n\nGeass:\nLelouch's Geass, given to him by C.C., grants him \"the power of absolute obedience,\" allowing him to plant commands within a person's mind upon eye contact which they will obey without question. Activation of his Geass is visually represented by the manifestation of a Geass sigil in his left eye. Commands dictated in this state are written into the minds of the designated targets once the sigil projects from his eye to theirs. Lelouch could initially toggle Geass activation at will, but subsequently loses this control to an affliction known as Geass runaway.\n \n[spoiler]\nIn the second season, C.C. gives Lelouch a contact lens that blocks his Geass, but indicates that his Geass will eventually grow powerful enough to render it ineffective.\n[\/spoiler]\n\nOf all the Geass abilities in the series, Lelouch's has been explored the most, and also seems to have the most restrictions and side effects of any Geass introduced.\n\n* Commands must be issued verbally.\n* The victim must make direct eye contact for commands to be issued. The maximum effective distance is 270 meters. Line of sight via a reflective surface is sufficient for the effect to occur.\n* Commands may be issued only once to any given individual, but any number of commands may be issued at initial application so long as eye contact is unbroken. Since Jeremiah's Geass Canceller negates all Geass effects, those exposed to it may be commanded once again.\n* The victim will not perform any action disallowed by their physical or mental capabilities, though they will try to carry out the command to the best of their ability. For example, a victim will not be able to correctly answer a question they don't know the answer to, but will direct the user to someone who can if they are able. However, commands that affect the mind or consciousness, such as telling the victim to forget something, will take effect despite the fact that the victim could not normally force themselves to do so.\n* An action will be carried out for as long as dictated in its command, or upon the indicated conditional circumstance. Eye contact does not need to be maintained for command execution to occur. No upper limit has been established, but the conditional command Lelouch gives Suzaku is still in effect more than a year later.\n* The victim's memories for the duration of command issue and execution are sealed and cannot be recalled.\n* A victim may resist a commanded action to some degree if it is utterly repugnant to them.\n\nSo long as the above conditions are met, commands may be issued to anybody besides those who have gained the power of immortality and to any number of individuals at once. Those under the effect of Geass have a red outline on their pupils, presumably a visual cue for the viewer since the characters never point it out.\n\nEven without his Geass, Lelouch is a formidable opponent. He is highly intelligent, possessing a genius-level intellect, and is capable of devising and executing strategies with incredible speed and precision. Rolo notes that operating the Absolute Defense Territory of the Shinkirō requires complex calculations which he cannot perform, while Lelouch almost makes it look easy. In the audio dramas, Suzaku says that, when they were children, Lelouch devised a secret sign language containing over 500 words.\n\nLelouch is quick to deduce facts from simple clues. In episode 14, when Mao says C.C.'s name, Lelouch instantly comes up with fourteen different possibilities for Mao's identity, including the correct one. Lelouch is also able to predict the Lancelot's actions exactly through his study of their past battles, allowing Kallen and the Four Holy Swords to almost defeat it (only Suzaku's reflexes saved his life).\n\nLelouch is also charismatic and persuasive; as Zero, he is able to win the support of much of Japan's population through well-delivered speeches combined with his ability to make miracles in almost any situation through his superior tactical planning. Mao repeatedly praises Lelouch's persuasive talent, and V.V. remarks that Lelouch is \"a lot like his father.\"\n\nPhysically, Lelouch is underwhelming. He possesses the physical prowess of a teenager who engages in little to no strenuous physical activity. Thus, one of Lelouch's traits is the inability to run very fast or for any substantial period of time. Within the series, this is usually played for comedic effect, as Lelouch is constantly outpaced by his classmates in every situation, and even the most simple tasks requiring manual labor exhaust him before he manages to accomplish anything significant. This joke is taken to its logical conclusion in the second season, where it is revealed that Lelouch is supposed to attend remedial physical education classes, but skips them as often as possible. This creates problems when Sayoko poses as Lelouch: she is a master of martial arts, and hence far more athletic than Lelouch himself. Lelouch laments the problem and decides to have Sayoko attend his gym classes to fix it.\n\nLelouch is also shown to be very talented at most domestic skills, including cooking and sewing; it has been stated that this comes as a result of his taking care of himself and Nunnally for seven years. He has been shown to be an excellent cook, and is usually the one cooking the food for parties held by the Student Council, both because the others (except Milly) are terrible cooks and nobody else can meet his exacting requirements (such as measuring ingredients to three significant decimals).\n\nLelouch also has some skill with firearms, usually brandishing a Britannian pistol when threatening someone. His Knightmare piloting skill has been shown to be proficient but not exceptional; he is a capable pilot by himself, though he tends to be overwhelmed by Suzaku and other pilots with more advanced Knightmares at their disposal. When Lelouch pilots a standard Knightmare on the battlefield, he is typically accompanied by Kallen, who is an elite Knightmare pilot and the leader of his personal squad, Squad Zero. \n \n[spoiler]\nAfter stealing the Gawain, Lelouch co-pilots it with C.C., controlling the weapons and command functions while C.C. handles navigation and flight. After the Black Knights are exiled from Japan, Lelouch pilots the Shinkirō, which has the most powerful defense of any Knightmare.\n[\/spoiler]\n[spoiler]\nAt the end of season 2, Lelouch ordered Suzaku to kill him so that his sins and all the people's hatred will disappear and he will be free. Killing him will be a key to future happiness. After Lelouch died, Nunnally realized that without her brother she cannot live even though she was away from him for a very long time.\n[\/spoiler]"},{"id":19,"coverImage":"31533.jpg","firstName":"Kallen","lastName":"Stadtfeld","japaneseName":"カレン・シュタットフェルト, 紅月カレン","alternateName":"Red Lotus, Karen Kouzuki, Q1","gender":"Female","biography":"Age: 17 (season 1) 18 (season 2)\nZodiac Sign: Aries\nBlood Type: B\nHeight: 173 cm (5'8\")\nBirth date: March 29, 2000\n\nA Britannian-Eleven girl, who believes herself to be a Japanese person at heart. Before the Britannia Empire conquered Area 11, Kallen's original name was Karen Kouzuki. She comes from a prestigious family and attends the Ashford Academy where she receives outstanding grades while serving as a member of its Student Council. When away from the Academy, she fights as an anti-Britannian operative. Also, Kallen helped organize the Black Knights. \n\nHer brother, Naoto Kouzuki (紅月ナオト Kōzuki Naoto?), with whom she had a deep connection, was a former leader of her resistance cell before his death.\n\nBoth Kallen's stepmother, a Britannian, and biological mother live with her in the same house, but her biological mother is employed as a maid and is often mistreated by both her stepmother and Kallen herself. After her biological mother is arrested for using Refrain (a fictional drug which lets people think they're reliving the past), Kallen changes her views and decides to fight against the Britannian Empire not only for her brother, but to fulfill her new wish for a world in which she can live happily with her biological mother.\n\nFrail and meek, this aspect of Kallen's character was used as a public front to mask her true nature as well as hide her involvement in the resistance.\n\nKallen leads a double life as a normal Britannian student and as a member of a guerrilla resistance group against Britannia, which is later reformed into the Order of the Black Knights by Lelouch Lamperouge. In school, she portrays herself as a weak-bodied high school student who obeys all of the formalities, and goes by her Britannian name of Stadtfeld. However, her personality changes in to a very strong-willed and forceful one when she acts as a resistance fighter.\n\nAs a running gag, Kallen ends up nude or immodestly dressed in front of other people on numerous occasions: Lelouch sees her naked after she pulls back a shower curtain in surprise in the third episode, Suzaku sees her bathing under a waterfall when they are stranded on Kaminejima, she is forced to dress in an immodest bunny costume at the start of the second season (to plant a tracking device on Lelouch), and she walks in on a meeting between C.C. and the Chinese ambassadors wearing only a towel when intending to complain about the previous situation to C.C. (claiming that the operation would've gone faster if C.C. was wearing the outfit).\n\nIn an interview reported by the anime magazine Newtype USA, seiyu Ami Koshimizu talked about the difficulty of voicing Kallen because of the double life that her character leads. Certain aspects of Kallen's character such as her girlish naivete and competitiveness made it easy for the voice actress to relate, even to the point of admitting that in some ways they act very much the same.\n\n "},{"id":20,"coverImage":"133107.jpg","firstName":"Kallen's","lastName":"Mother","japaneseName":"カレンの母","alternateName":"","gender":"Female","biography":"She's a Japanese woman who works as a maid in the house of Kallen's father to be close to her daughter.\n "},{"id":21,"coverImage":"140811.jpg","firstName":"Kallen's","lastName":"Stepmother","japaneseName":"正妻","alternateName":null,"gender":"Female","biography":"Kallen's Stepmother is the legal wife of Kallen Kozuki's biological father, Mr. Stadtfeld.\n "},{"id":22,"coverImage":"147121.jpg","firstName":"Shogo","lastName":"Asahina","japaneseName":"朝比奈 省悟","alternateName":null,"gender":"Male","biography":"Shōgo Asahina is a male member of the Four Holy Swords. He wears glasses and has a distinctive scar down the right side of his face. He is the leader of the first squadron of the Black Knights. Like Chiba, he develops a distrust for Zero following the Black Rebellion, questioning his tendancy to keep secrets and bring on new members such as Rolo and Jeremiah with no discussion. During the second battle of Tokyo, he is caught in the blast radius of Nina's F.L.E.I.J.A. bomb, but not before transmitting information which he claims will prove that Zero can't be trusted.\n "},{"id":23,"coverImage":"63233.jpg","firstName":"Milly","lastName":"Ashford","japaneseName":null,"alternateName":null,"gender":"Female","biography":"Age: 18 \nZodiac Sign: Leo \nBlood Type: O \nBirthday: July 24th\nHeight: 182 cm\n\nMilly Ashford is the granddaughter of the school superintendent, Ruben K. Ashford, and president of the Student Council. Milly enjoys teasing Shirley and is eager to discover Lelouch's weaknesses — enough so to rally the entire school into chasing after Arthur when she suspects the cat to hold something precious to him. She is secretly in love with Lelouch, but realizes the need to restore her family's status by marrying a noble. \n \n\nSpoiler:\nMilly is aware of Lelouch's identity as a former prince of Britannia, her family having supported Empress Marianne. In the second picture drama special included on the DVD release, her grandfather and Nina's grandfather are said to have worked on the Io and Ganymede Knightmare Frames together. Marianne's assassination led to the family's nobility status being stripped. The Ashfords arrange for Milly to marry Earl Lloyd Asplund to restore it. After the events of the first season, Milly remains a student on campus because she failed her examinations, although it is noted that she did so on purpose to remain on campus with her friends. She eventually earns enough credits to graduate and becomes a weather forecaster on the local TV news. She also breaks off her engagement with Lloyd.\n "},{"id":24,"coverImage":"83148.jpg","firstName":"Lloyd","lastName":"Asplund","japaneseName":"ロイド・アスプルンド","alternateName":"Earl of Pudding ","gender":"Male","biography":"Age: 29 (first season) 30 (second season)\nZodiac Sign: Aquarius\nBlood Type: AB\nBirthday: February 2nd\n\nLloyd Asplund is an earl of the Britannian nobility and the developer of the elite Knightmare Frame Lancelot. To keep from being reminded of the fragility of human lives and friendship, Lloyd immerses himself in science and has come to view people as nothing more than tools — he regards Suzaku, for example, as a mere component of the machine that he pilots. He has a tendency to mock others and is often rebuked for this behavior by Cécile Croomy, his assistant. Prior to joining the military, he attended the Imperial Colchester Institute. Lloyd's research organization, Camelot is an irregular division of the Britannian Military and has been granted permission by Prince Schneizel to operate outside the command structure and regulations of the regular Britannian armed forces.\n\nRakshata refers to Lloyd as the Earl of Pudding, as pudding is his favorite food.\n He is engaged to wed Milly Ashford in the first season, having agreed to the union mostly in hope that he might obtain the designs of the Knightmare Frame Ganymede. As such, he is forced into doing nice things for her by Suzaku, though Milly breaks off the engagement after she graduates.\n "},{"id":25,"coverImage":"147139.jpg","firstName":"Bartley","lastName":"Asprius","japaneseName":"バトレー・アスプリウス","alternateName":null,"gender":"Male","biography":"Bartley Asprius is a large and balding Britannian general who commands the Code R research team. \n\nSpoiler:\nAfter the assassination of Clovis, he is stripped of his rank by Jeremiah and sent back to Britannia as a prisoner. He subsequently returns to the military under the command of Prince Schneizel. He oversees Jeremiah Gottwald's transformation into a cyborg and tries in vain to stop Jeremiah when he wakes up prematurely. After V.V. recruits Jeremiah, Bartley is ordered by the Emperor to help finish Jeremiah's modifications, which he does not seem happy about. After completing his task, he expresses the desire to leave, knowing that the Emperor's plans could mean the end of the world. During the Black Knights assault on the Geass Directorate stronghold, Bartley is killed in the attack. Before his demise he sees C.C. and laments to the deceased Prince Clovis that they should never have captured her.\n "},{"id":26,"coverImage":"33779.jpg","firstName":"Rivalz","lastName":"Cardemonde","japaneseName":"リヴァル・カルデモンド","alternateName":"","gender":"Male","biography":"Age: 17 \nZodiac Sign: Cancer \nBlood Type: AB \nBirthday: July 20th\n\nRivalz Cardemonde is one of Lelouch's friends, usually driving Lelouch around on his motorbike as an ante for their bets on chess games. He has a part-time job as a bartender\/waiter and carries an unrequited love for Milly Ashford especially when it is announced that she is going through a marriage interview. \n\nShown in-series and in the DVD-exclusive bonus material, Rivalz forms a fast friendship with Suzaku after he joins the student council at Lelouch's request. Rivalz's real surname is not Cardemonde, which is his mother's maiden name that he uses after his parents became estranged. \n \nSpoiler:\nHe was born and partially raised in California. Rivalz is last seen in Ohgi and Villetta's wedding picture.\n "},{"id":27,"coverImage":"29374.jpg","firstName":"Rakshata","lastName":"Chawla","japaneseName":"ラクシャータ・チャウラー","alternateName":"","gender":"Female","biography":"Birthday: November 17\n\nRakshata Chawla is an Indian scientist and the head of the Black Knights' research and development team. She has extensive experience in medical cybernetics, and appears to have been an academy acquaintance of Lloyd Asplund and Cécile Croomy. Rakshata is not fond of speaking of the past, but it is known that she studied at the Imperial Colchester Institute. She is fairly laid back in most situations, usually seeing laying on a couch when not actively working (one is even installed on the bridge of the Black Knights' flagship, the Ikaruga), and is never seen without her tobacco pipe. She affectionately refers to her technological creations as her \"children\" and treats them as such. She is visibly enraged, a contrast to her normal demeanor, upon learning that Lloyd and Cécile modified her Knightmare without her consent (they are kind enough to credit her for the design, though). Upon the formation of the UFN and the reorganization of the Black Knights as its military force, Rakshata is designated as the Chief of Science, similar to her previous position within the Black Knights.Rakshata is the creator of the Guren Mk-II and its radiant wave surger weapon. She also developed the Gefjun Disturber, a force field generator that disables all sakuradite-powered technology within its area of effect. This includes Knightmares, though by the second season newer models have countermeasures added to negate the Disturber's effect; only fifth-generation or older Knightmares remain vulnerable. In addition, the field blocks the motion of hadrons, radio waves, and microwaves. This renders anything within the field invisible to radar, and can aid in the blooming of hadron-based beam weaponry. It is named after the Norse goddess of chastity Gefjun. "},{"id":28,"coverImage":"29369.jpg","firstName":"Nagisa","lastName":"Chiba","japaneseName":"千葉凪沙","alternateName":null,"gender":"Female","biography":"Nagisa Chiba is the sole female member of the Four Holy Swords. Nagisa is a devoted follower of Tohdoh and is enamored with him. A year after the Black Rebellion, she harbors animosity towards Zero for abandoning them.\n "},{"id":29,"coverImage":"132973.jpg","firstName":"Cécile","lastName":"Croomy","japaneseName":"セシル・クルーミー","alternateName":"","gender":"Female","biography":" Age: 24\nZodiac Sign: Virgo\nBlood Type: O\n\nCécile Croomy is one of the Lancelot's developers and Lloyd's assistant. Cécile is a kind-hearted woman and a good friend to Suzaku, often helping him with homework. She also acts as Lloyd's conscience, not hesitating to scold him or physically punish him for his unintentionally rude remarks. Cécile is a capable Knightmare Frame pilot, managing to single-handedly hold the entire contingent of Black Knights sent to occupy Ashford Academy during the Black Rebellion at bay using a Sutherland modified with equipment from the Lancelot. Prior to joining Lloyd in the military, she studied at the Imperial Colchester Institute. A recurring joke is that Cécile is a bad cook, which no one has the heart to tell her: her recipes includes onigiri mixed with blueberry jam and sandwiches made with ginger, sugar, and wasabi.\n "}]